package com.example.niubilityapp.model;

import java.util.List;

public class JokeModel {


    /**
     * page : 1
     * totalCount : 9590
     * totalPage : 959
     * limit : 10
     * list : [{"content":"跟老公看电视呢，电视里女主趴桌子上睡着了，男主抱起来送床上还睡得香香的，我跟老公说这电视太假了，睡着了被人抱起来要是我的话肯定醒了老公说那是，要是你的话我还得扎好马步，一边抱一边还得喊一二三起，一次还不一定抱的起来，能不醒嘛。  ----分享自段子乐","updateTime":"2018-11-03 11:07:21"},{"content":"别人没有必要对我好","updateTime":"2018-11-03 11:05:42"},{"content":"遇上了暗恋的妹子，上前向她打招呼。她毫不留情的对我说句：\u201c怎么你还没死呢？\u201d顿时心不禁一激向天叹声：\u201c苍天啊，这年头还有妹子在乎我的生死。\u201d一下子又找到了活下去的目标了。  ----分享自段子乐","updateTime":"2018-11-03 09:58:43"},{"content":"外出游玩，发现有个衣着性感的姑娘准备投水自尽，我忙过去一把抱住：\u201c有什么想不开的事，给哥说说！ \u201d她挣扎着：\u201c放开我，放开我！ \u201d俗话说，救人一命，胜造七级浮屠，打死我也不放。姑娘急了：\u201c你TM见过穿着比基尼跳泳池自杀的么？臭流氓！ \u201d  ----分享自段子乐","updateTime":"2018-11-03 09:53:13"},{"content":"防不住麦迪是因为你不知道他还有没有下一步，防不住艾弗森是因为你跟不上他的下一步。防不住科比是你不知道他下一步干什么，防不住乔丹是因为你即使知道他下一步干什么也没用，防不住詹姆斯是因为，你永远不知道他下一步。。还要走几步。  ----分享自段子乐","updateTime":"2018-11-03 09:52:30"},{"content":"朋友说他有一个购物返利的电话。我很惊讶：\u201c你确定不是网站而是电话？\u201d朋友说：\u201c你网购收到货后打这个电话就能返利，不过返得不是很多。\u201d我抱着试一试的心态拨通了这个电话，只听见电话那边传来一个普通话不太标准的男声问：\u201c喂，是要上门收废品吗？  ----分享自段子乐","updateTime":"2018-11-03 09:47:40"},{"content":"老爸不让我下河洗澡，偷偷跑去洗澡被逮到。 啪，一耳光抽过来，问我好玩不？ 我说好玩。。啪，又是一耳光，接着问我好玩不？ 我说不好玩。。啪，再来一耳光，说不好玩你还玩。。。  ----分享自段子乐","updateTime":"2018-11-03 09:46:52"},{"content":"今天在马路边，走过来一女孩，大学生的样子。好像要问路，上来就叫：叔叔。。。,擦， 老子三十还没有呢，那里像大叔？,于是我双手一抱拳：嫂嫂，什么事？  ----分享自段子乐","updateTime":"2018-11-03 09:45:52"},{"content":"女：我想嫁个高富帅！男鄙夷的说道：神马？就你？女：好吧！只要有钱都行！男：保险柜！  ----分享自段子乐","updateTime":"2018-11-03 09:45:44"},{"content":"某天乘公车去A地。途中车内有一小偷在偷一大妈的手机，结果偷到手一看是一诺基亚黄屏手机。小偷拍拍大妈胳膊说：\u201c大妈您手机掉了。\u201d  ----分享自段子乐","updateTime":"2018-11-03 09:45:36"}]
     */

    public int page;
    public int totalCount;
    public int totalPage;
    public int limit;
    public List<ListBean> list;

    public static class ListBean {
        /**
         * content : 跟老公看电视呢，电视里女主趴桌子上睡着了，男主抱起来送床上还睡得香香的，我跟老公说这电视太假了，睡着了被人抱起来要是我的话肯定醒了老公说那是，要是你的话我还得扎好马步，一边抱一边还得喊一二三起，一次还不一定抱的起来，能不醒嘛。  ----分享自段子乐
         * updateTime : 2018-11-03 11:07:21
         */

        public String content;
        public String updateTime;
    }

}
